Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, 1024, 128, 1 0                                            
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 512, 64, 4)   0           input[0][0]                      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 512, 64, 8)   296         reshape_2[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 512, 64, 8)   0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 256, 16, 16)  1040        activation_7[0][0]               
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 256, 16, 16)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
gated_conv_3 (GatedConv)        (None, 256, 16, 16)  2320        activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 256, 16, 32)  4640        gated_conv_3[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 256, 16, 32)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
gated_conv_4 (GatedConv)        (None, 256, 16, 32)  9248        activation_9[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 4, 64)   16448       gated_conv_4[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 128, 4, 64)   0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
gated_conv_5 (GatedConv)        (None, 128, 4, 64)   36928       activation_10[0][0]              
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 4, 128)  73856       gated_conv_5[0][0]               
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 128, 4, 128)  0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 128, 1, 128)  0           activation_11[0][0]              
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 128, 128)     0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 128, 256)     263168      reshape_3[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128, 128)     32896       bidirectional_2[0][0]            
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 128, 128)     0           dense_2[0][0]                    
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) (None, 128, 256)     263168      activation_12[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 128, 96)      24672       bidirectional_3[0][0]            
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 128, 96)      0           dense_3[0][0]                    
__________________________________________________________________________________________________
labels (InputLayer)             [(None, None)]       0                                            
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
CTCloss (Lambda)                (None, 1)            0           activation_13[0][0]              
                                                                 labels[0][0]                     
                                                                 input_length[0][0]               
                                                                 label_length[0][0]               
==================================================================================================
Total params: 728,680
Trainable params: 728,680
Non-trainable params: 0
__________________________________________________________________________________________________
