Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, 1024, 128, 1 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 64, 16)  160         input[0][0]                      
__________________________________________________________________________________________________
p_re_lu (PReLU)                 (None, 512, 64, 16)  16          conv2d[0][0]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 512, 64, 16)  98          p_re_lu[0][0]                    
__________________________________________________________________________________________________
gated (Gated)                   (None, 512, 64, 16)  4640        batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 64, 32)  4640        gated[0][0]                      
__________________________________________________________________________________________________
p_re_lu_1 (PReLU)               (None, 512, 64, 32)  32          conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512, 64, 32)  194         p_re_lu_1[0][0]                  
__________________________________________________________________________________________________
gated_1 (Gated)                 (None, 512, 64, 32)  18496       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 256, 16, 40)  10280       gated_1[0][0]                    
__________________________________________________________________________________________________
p_re_lu_2 (PReLU)               (None, 256, 16, 40)  40          conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 256, 16, 40)  242         p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
gated_2 (Gated)                 (None, 256, 16, 40)  28880       batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 256, 16, 40)  0           gated_2[0][0]                    
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 16, 48)  17328       dropout[0][0]                    
__________________________________________________________________________________________________
p_re_lu_3 (PReLU)               (None, 256, 16, 48)  48          conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 256, 16, 48)  290         p_re_lu_3[0][0]                  
__________________________________________________________________________________________________
gated_3 (Gated)                 (None, 256, 16, 48)  41568       batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256, 16, 48)  0           gated_3[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 4, 56)   21560       dropout_1[0][0]                  
__________________________________________________________________________________________________
p_re_lu_4 (PReLU)               (None, 128, 4, 56)   56          conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 4, 56)   338         p_re_lu_4[0][0]                  
__________________________________________________________________________________________________
gated_4 (Gated)                 (None, 128, 4, 56)   56560       batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 128, 4, 56)   0           gated_4[0][0]                    
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 4, 64)   32320       dropout_2[0][0]                  
__________________________________________________________________________________________________
p_re_lu_5 (PReLU)               (None, 128, 4, 64)   64          conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128, 4, 64)   386         p_re_lu_5[0][0]                  
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 2, 64)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
reshape (Reshape)               (None, 128, 128)     0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 128, 256)     263168      reshape[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 128, 128)     32896       bidirectional[0][0]              
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 128, 256)     263168      dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128, 96)      24672       bidirectional_1[0][0]            
__________________________________________________________________________________________________
activation (Activation)         (None, 128, 96)      0           dense_1[0][0]                    
__________________________________________________________________________________________________
labels (InputLayer)             [(None, None)]       0                                            
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
CTCloss (Lambda)                (None, 1)            0           activation[0][0]                 
                                                                 labels[0][0]                     
                                                                 input_length[0][0]               
                                                                 label_length[0][0]               
==================================================================================================
Total params: 822,140
Trainable params: 821,104
Non-trainable params: 1,036
__________________________________________________________________________________________________
