Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, 1024, 128, 1 0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 512, 64, 4)   0           input[0][0]                      
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 64, 8)   296         reshape[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 512, 64, 8)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 16, 16)  1040        activation[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 16, 16)  0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
gated_conv (GatedConv)          (None, 256, 16, 16)  2320        activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 256, 16, 32)  4640        gated_conv[0][0]                 
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 256, 16, 32)  0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
gated_conv_1 (GatedConv)        (None, 256, 16, 32)  9248        activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 4, 64)   16448       gated_conv_1[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 128, 4, 64)   0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
gated_conv_2 (GatedConv)        (None, 128, 4, 64)   36928       activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 4, 128)  73856       gated_conv_2[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 128, 4, 128)  0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 1, 128)  0           activation_4[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 128, 128)     0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 128, 256)     263168      reshape_1[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 128, 128)     32896       bidirectional[0][0]              
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 128, 128)     0           dense[0][0]                      
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 128, 256)     263168      activation_5[0][0]               
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128, 96)      24672       bidirectional_1[0][0]            
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 128, 96)      0           dense_1[0][0]                    
__________________________________________________________________________________________________
labels (InputLayer)             [(None, None)]       0                                            
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
CTCloss (Lambda)                (None, 1)            0           activation_6[0][0]               
                                                                 labels[0][0]                     
                                                                 input_length[0][0]               
                                                                 label_length[0][0]               
==================================================================================================
Total params: 728,680
Trainable params: 728,680
Non-trainable params: 0
__________________________________________________________________________________________________
