Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, 1024, 128, 1 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 1024, 128, 16 160         input[0][0]                      
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 1024, 128, 16 64          conv2d[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 1024, 128, 16 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 512, 64, 16)  0           leaky_re_lu[0][0]                
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 64, 32)  4640        max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512, 64, 32)  128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 512, 64, 32)  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 256, 32, 32)  0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (None, 256, 32, 32)  0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 256, 32, 48)  13872       dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 256, 32, 48)  192         conv2d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 256, 32, 48)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 128, 16, 48)  0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128, 16, 48)  0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 16, 64)  27712       dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 16, 64)  256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 128, 16, 64)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 128, 16, 64)  0           leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 16, 80)  46160       dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 16, 80)  320         conv2d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 128, 16, 80)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
reshape (Reshape)               (None, 128, 1280)    0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 128, 512)     3147776     reshape[0][0]                    
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 128, 512)     1574912     bidirectional[0][0]              
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 128, 512)     1574912     bidirectional_1[0][0]            
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) (None, 128, 512)     1574912     bidirectional_2[0][0]            
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) (None, 128, 512)     1574912     bidirectional_3[0][0]            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 128, 512)     0           bidirectional_4[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 128, 96)      49248       dropout_3[0][0]                  
__________________________________________________________________________________________________
activation (Activation)         (None, 128, 96)      0           dense[0][0]                      
__________________________________________________________________________________________________
labels (InputLayer)             [(None, None)]       0                                            
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
CTCloss (Lambda)                (None, 1)            0           activation[0][0]                 
                                                                 labels[0][0]                     
                                                                 input_length[0][0]               
                                                                 label_length[0][0]               
==================================================================================================
Total params: 9,590,176
Trainable params: 9,589,696
Non-trainable params: 480
__________________________________________________________________________________________________
